app/controllers/assignments_controller.rb

  def index
    @assignments = DutyAssignment.includes(:user).recent.limit(20)
    @current_assignment = DutyAssignment.for_date(Date.current).first
    @upcoming_assignments = DutyAssignment.where(assignment_date: Date.current..1.week.from_now).recent
---
SELECT "duty_assignments".* FROM "duty_assignments" WHERE "duty_assignments"."assignment_date" = ? ORDER BY "duty_assignments"."id" ASC LIMIT ?  [["assignment_date", "2025-07-12"], ["LIMIT", 1]]

  def set_assignment
    @assignment = DutyAssignment.find(params[:id])
---
SELECT "duty_assignments".* FROM "duty_assignments" WHERE "duty_assignments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]