app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "slack_id", "vacation_start_date", "vacation_end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "is_active" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_active", 1], ["updated_at", "2025-07-12 05:49:18.348223"], ["id", 1]]
---
  def update
    if @user.update(user_params)